In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
#I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

In [7]:
#Just took out the features that wont determine whether the person survived or not.
#Did so by using the df.drop command.
#data.head()::The head() function is used to get the first n rows.
#axis='columns':: selects along columns can also write as axis=1 and for row axis=(index[the row number],0) or axis=(index[the row number],'row')
#inplace=True:: Now axis='columns' only deletes the column temporarily hence inplace=True deletes it permanantly
#target is the column we want to branch into a different table. Here we drop the Survived column  
#dummies: One Hot Encoding which converts text data to numerical data eg:here sex

In [8]:
#Pandas dataframe.isna() function is used to detect missing values.

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
#fill the NaN values with the mean of the entire column

In [14]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [15]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [18]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [19]:
#here inputs and target is the inputs for splitting data
#test_size=0.3 is dividing the data into 80-20 ratio

In [20]:
len(X_train)

712

In [21]:
len(X_test)

179

In [22]:
len(inputs)

891

In [23]:
#Creating the naive bayes model
#here we are using gaussian naive bayes class

In [24]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [25]:
#time to train the model also called as fitting a model

In [26]:
model.fit(X_train,y_train)

GaussianNB()

In [27]:
#after train test score

In [28]:
model.score(X_test,y_test)

0.7932960893854749

In [29]:
#it is 79%

In [30]:
X_test[:10]

     Pclass        Age     Fare  female
186       3  29.699118  15.5000       1
98        2  34.000000  23.0000       1
309       1  30.000000  56.9292       1
747       2  30.000000  13.0000       1
94        3  59.000000   7.2500       0
548       3  33.000000  20.5250       0
748       1  19.000000  53.1000       0
408       3  21.000000   7.7750       0
695       2  52.000000  13.5000       0
668       3  43.000000   8.0500       0

In [31]:
y_test[:10]

186    1
98     1
309    1
747    1
94     0
548    0
748    0
408    0
695    0
668    0
Name: Survived, dtype: int64

In [32]:
model.predict(X_test[0:10])

array([1, 1, 1, 1, 0, 0, 0, 0, 0, 0], dtype=int64)

In [33]:
#probability of survival

In [34]:
model.predict_proba(X_test[:10])

array([[0.45759825, 0.54240175],
       [0.27649072, 0.72350928],
       [0.05251465, 0.94748535],
       [0.27447766, 0.72552234],
       [0.96302761, 0.03697239],
       [0.96682489, 0.03317511],
       [0.64483772, 0.35516228],
       [0.96186269, 0.03813731],
       [0.92810552, 0.07189448],
       [0.96732556, 0.03267444]])

In [35]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.79020979, 0.74825175, 0.78169014, 0.78873239, 0.75352113])